using app.Models;

namespace app.Interfaces;

// Определяет контракт для управления словарём слов.
public interface IDictionaryRepository
{
    // Добавляет новое слово в словарь.
    // "word" Объект слова, которое необходимо добавить.
    // Возвращает true, если добавление прошло успешно; иначе false.
    bool AddWord(Word word);

    // Удаляет слово из словаря по его английскому названию.
    // "english" Английское слово, которое необходимо удалить
    // Возвращает true, если удаление прошло успешно; иначе false.
    bool DeleteWord(string english);

    // Получает случайное слово из словаря.
    // Возвращает случайное слово, или null, если словарь пуст.
    Word? GetRandomWord();

    // Проверяет, содержит ли словарь хотя бы одно слово.
    // Возвращает true, если словарь содержит слова; иначе false.
    bool HasWords();

    // Получает все слова из словаря.
    // Возвращает список всех слов в словаре.
    List<Word> GetAllWords();
}